stm32-hotspot/STM32WBA-BLE-GenericHealthSensor/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_GenericHealthSensor/STM32_WPAN/App/app_ble.c
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    /* Clear Security Database */
    ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("==>> aci_gap_clear_security_db - Fail, result: %d \n", ret);
    }
    else
    {
      LOG_INFO_APP("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  else
  {
    /* Security Request */
    ret = aci_gap_slave_security_req(bleAppContext.BleApplicationContext_legacy.connectionHandle); 
    
    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("==>> aci_gap_slave_security_req() Fail , result: %d \n", ret);
    }
    else
    {
      LOG_INFO_APP("===>> aci_gap_slave_security_req - Success\n");
    }
  }
#else
  /* Update GHS Observation Schedule Changed */
  GHS_APP_UpdateObservationScheduleChanged();
  
  /* Update ETS Elapsed Time TZDSTOffset */
  uint8_t a_elapsedTime[9];
  
  /* Get current ETS Elapsed Time */
  ETS_APP_GetElapsedTime(a_elapsedTime);

  a_elapsedTime[8] += 1; /* TZDSTOffset = TZDSTOffset + 1; */
  
  /* Set new ETS Elapsed Time */
  ETS_APP_SetElapsedTime(a_elapsedTime);
  
  /* Generates 1 Live Health Observations and stores in DB */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_LHO_ID, CFG_SEQ_PRIO_0);
#endif
  return;
}

void APPE_Button3Action(void)
{
#if(BLE_CFG_GHS_PTS == 0)
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    
  }
  else
  {
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_CONN_PARAM_UPDATE);
  }
#else
  extern uint8_t GHS_APP_LHOIndex;

  GHS_APP_LHOIndex ++;
  if(GHS_APP_LHOIndex > 8)
  {
    GHS_APP_LHOIndex = 0;
  }
  LOG_INFO_APP("Live Health Observations with Observation Class Type:%d \n", GHS_APP_LHOIndex+1);

  RCS_APP_UpdateFeature();
#endif
  return;
}
#endif
/* USER CODE END FD_WRAP_FUNCTIONS */
